lib/xml/deleteUserProfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:deleteUserProfile>
            <!--Optional:-->
            <userProfileName>?</userProfileName>
        </ser:deleteUserProfile>
    </soapenv:Body>
</soapenv:Envelope>